Repository: jonesholger/BOUT-dev
Catalog: locale/*/libbout.po
Languages: es

source: -> Core region jyseps2_1-jyseps1_1 (%d-%d = %d) must be a multiple of MYSUB (%d)
es: -> La región `Core` jyseps2_1-jyseps1_1 (%d-%d = %d) debe ser un múltiplo de MYSUB (%d)

source: -> Core region jyseps2_2-jyseps1_1 (%d-%d = %d) must be a multiple of MYSUB (%d)
es: -> La región `Core` jyseps2_2-jyseps1_1 (%d-%d = %d) debe ser un múltiplo de MYSUB (%d)

source: -> Core region jyseps2_2-jyseps1_2 (%d-%d = %d) must be a multiple of MYSUB (%d)
es: -> La región `Core` jyseps2_2-jyseps1_2 (%d-%d = %d) debe ser un múltiplo de MYSUB (%d)

source: -> Good value
es: -> El valor es bueno

source: -> Leg region jyseps1_1+1 (%d) must be a multiple of MYSUB (%d)
es: -> La región `Leg` jyseps1_1+1 (%d) debe ser un múltiplo de MYSUB (%d)

source: -> leg region jyseps1_2-ny_inner+1 (%d-%d+1 = %d) must be a multiple of MYSUB (%d)
es: -> La región `Leg` jyseps1_2-ny_inner+1 (%d-%d+1 = %d) debe ser un múltiplo de MYSUB (%d)

source: -> leg region ny-jyseps2_2-1 (%d-%d-1 = %d) must be a multiple of MYSUB (%d)
es: -> La región `Leg` ny-jyseps2_2-1 (%d-%d-1 = %d) debe ser un múltiplo de MYSUB (%d)

source: -> leg region ny_inner-jyseps2_1-1 (%d-%d-1 = %d) must be a multiple of MYSUB (%d)
es: -> La región `Leg` ny_inner-jyseps2_1-1 (%d-%d-1 = %d) debe ser un múltiplo de MYSUB (%d)

source: -> ny/NYPE (%d/%d = %d) must be >= MYG (%d)
es: -> ny/NYPE (%d/%d = %d) debe ser >= MYG (%d)

source: Candidate value: %d
es: Valor candidato: %d

source: Checking disabled
es: Comprobación desactivada

source: Checking enabled, level %d
es: Comprobación activada, nivel %d

source: Command line options for this run :
es: Parámetros de línea de comandos para esta ejecución :

source: Compiled with flags : %s
es: Compilado con las opciones `flags` : %s

source: Domain split (NXPE=%d, NYPE=%d) into domains (localNx=%d, localNy=%d)
es: Dominio separado (NXPE=%d, NYPE=%d) en los dominios (localNx=%d, localNy=%d)

source: ERROR: Cannot split %d Y points equally between %d processors
es: ERROR: No se pueden separar %d Y puntos entre %d procesadores por igual

source: Empty key Line: %s
es: Entrada vacía Línea: %s

source: Empty key or value in command line '%s'
es: Entrada o valor vacío en la línea de comandos '%s'

source: Grid size:
es: Tamaño de la malla (`grid`):

source: Key must not contain ':' character Line: %s
es: La entrada no debe contener el carácter ':' Línea: %s

source: Multiple '=' in command-line argument '%s'
es: Mutilples '=' en el argumento de la línea de comandos '%s'

source: OpenMP parallelisation disabled
es: Paralelización en OpenMP desactivada

source: OpenMP parallelisation enabled, using %d threads
es: Paralelización en OpenMP activada, usando %d procesos (`threads`)

source: Option
es: Opción

source: Option '%s': Boolean expected. Got '%s'
es: Opción '%s': valor Booleano esperado. Se obtuvo '%s'

source: Options file '%s' not found
es: Opciones de archivo '%s' no encontrados

source: Parallel NetCDF support disabled
es: Soporte para NetCDF paralelo desactivado

source: Parallel NetCDF support enabled
es: Soporte para NetCDF paralelo activado

source: Read nz from input grid file
es: Leer nz del archivo input de la malla `grid`

source: Reading contravariant vector
es: Leyendo vector contravariante

source: Reading covariant vector
es: Leyendo vector covariante

source: Signal handling disabled
es: Gestión de señal desactivada

source: Signal handling enabled
es: Gestión de señal activada

source: done
es: listo

source: netCDF support disabled
es: Soporte netCDF desactivado

source: netCDF support enabled
es: Soporte netCDF activado

source: netCDF4 support enabled
es: Soporte netCDF4 activado

source: -d <data directory> Look in <data directory> for input/output files -f <options filename> Use OPTIONS given in <options filename> -o <settings filename> Save used OPTIONS given to <options filename> -l, --log <log filename> Print log to <log filename> -v, --verbose Increase verbosity -q, --quiet Decrease verbosity
es: -d <data directory> Buscar en <data directory> los archivos input/output -f <options filename> Usar OPCIONES descritas en <options filename> -o <settings filename> Guardar OPCIONES usadas descritas en <options filename> -l, --log <log filename> Imprimir registro `log` en <log filename> -v, --verbose Aumentar verbosidad -q, --quiet Disminuir verbosidad

source: Run finished at : %s
es: Ejecución finalizada en : %s

source: Run started at : %s
es: Ejecución iniciada en : %s

source: -c, --color Color output using bout-log-color
es: -c, --color Salida de color usando bout-log-color

source: -h, --help This message restart [append] Restart the simulation. If append is specified, append to the existing output files, otherwise overwrite them VAR=VALUE Specify a VALUE for input parameter VAR For all possible input parameters, see the user manual and/or the physics model source (e.g. %s.cxx)
es: -h, --help Este mensaje restart [append] Reiniciar la simulación. Si se especificó `append`, agregar a los archivos de salida existentes, de lo contrario sobreescribirlos VAR=VALUE Especificar un VALOR para el parámetro input VAR Para todos los possibles parámetros input, vea el manual de usuario y/o el modelo físico fuente (ej. %s.cxx)

source: All options used
es: Usando todas las opciones

source: BOUT++ version %s
es: Versión de BOUT++ %s

source: Boundary regions in this processor:
es: Regiones frontera en este procesador:

source: Cannot split %d X points equally between %d processors
es: No se pueden dividir %d X points entre %d procesadores por igual

source: Code compiled on %s at %s
es: Código compilado en %s en %s

source: Command line
es: Línea de comandos

source: Compile-time options:
es: Opciones de tiempo de compilación:

source: Constructing default regions
es: Construyendo regiones por defecto

source: Could not find a valid value for NXPE. Try a different number of processors.
es: No se pudo encontrar un valor válido para NXPE. Intente usar un número diferente de procesadores.

source: Could not open output file '%s'
es: No se pudo abrir el archivo de salida `output` '%s'

source: Could not read integer array '%s'
es: No se pudo leer la matriz de enteros '%s'

source: Could not run bout-log-color. Make sure it is in your PATH
es: No se pudo ejecutar bout-log-color. Asegúrese de que se encuentre en su PATH

source: Couldn't add Monitor: %g is not a multiple of %g!
es: No se pudo añadir el Monitor: %g no és multiplo de %g!

source: Couldn't find region %s in regionMap2D
es: No se pudo encontrar la región %s en regionMap2D

source: Couldn't find region %s in regionMap3D
es: No se pudo encontrar la región %s en regionMap2D

source: Couldn't find region %s in regionMapPerp
es: No se pudo encontrar la región %s en regionMapPerp

source: Couldn't get BoutReal from option %s = '%s'
es: No se pudo recuperar BoutReal de la opción %s = '%s'

source: Couldn't get integer from option %s = '%s'
es: No se pudo recuperar el entero de la opción %s = '%s'

source: DataDir "%s" does not exist or is not accessible
es: DataDir "%s" no existe o no es accessible

source: DataDir "%s" is not a directory
es: DataDir "%s" no es un directorio

source: ERROR: Solver is already initialised
es: ERROR: el Solver ya se encuentra inicializado

source: Error encountered during initialisation: %s
es: Error encontrado durante la inicialización:%s

source: Error whilst writing settings
es: Error durante el paso de opciones

source: Error: nx must be greater than 2 times MXG (2 * %d)
es: Error: nx debe ser mayor que 2 veces MXG (2 * %d)

source: Failed to initialise solver-> Aborting
es: Fallo en inicializar el solver-> Abortando

source: Finding value for NXPE (ideal = %f)
es: Encontrando valor para NXPE (ideal = %f)

source: Initialising solver
es: Initializando el solver

source: Input and output file for settings must be different. Provide -o <settings file> to avoid this issue.
es: Archivos de entrada y salida (`input/output`) para las opciones deben ser diferentes. Añada -o <settings file> para evitar este problema.

source: Loading mesh
es: Cargando malla `mesh`

source: Mesh must contain nx
es: La malla `mesh` debe contener nx

source: Mesh must contain ny
es: La malla `mesh` debe contener ny

source: Missing integer array %s
es: Fala la matriz entera %s

source: Monitor signalled to quit
es: Monitor indicó salir

source: Monitor signalled to quit
es: Monitor indicó salir

source: No boundary regions in this processor
es: Sin regiones de frontera en este procesador

source: Number of processors (%d) not divisible by NPs in x direction (%d)
es: Número de procesadores (%d) no divisible para NPs en la dirección x (%d)

source: Option %s has no value
es: Opción %s sin valor

source: Option %s is not a section
es: Opción %s no es una sección

source: Option %s:%s does not exist
es: Opción %s:%s no existe

source: Options: Setting a value from same source (%s) to new value '%s' - old value was '%s'.
es: Opciones: Cambiando valor de la misma fuente (%s) al valor nuevo '%s' - valor anterior era '%s'.

source: Processor number: %d of %d
es: Procesador número: %d de %d

source: Registered region 2D %s
es: Región 2D registrada %s

source: Registered region 3D %s
es: Región 3D registrada %s

source: Registered region Perp %s
es: Región Perp registrada %s

source: Revision: %s
es: Revisión: %s

source: Run time :
es: Tiempo de ejecución :

source: Running simulation
es: Ejecutando simulación

source: Sim Time | RHS evals | Wall Time | Calc Inv Comm I/O SOLVER
es: Tiempo Sim | RHS eval. | Tiempo Wall | Calc Inv Com I/O SOLVER

source: Sim Time | RHS_e evals | RHS_I evals | Wall Time | Calc Inv Comm I/O SOLVER
es: Tiempo Sim | RHS_e eval. | RHS_I eval. | Tiempo Wall | Calc Inv Com I/O SOLVER

source: Solver running for %d outputs with monitor timestep of %e
es: Solver corriendo para %d outputs con intervalos de tiempo de monitor de %e

source: Solver running for %d outputs with output timestep of %e
es: Solver corriendo para %d outputs con intervalos de tiempo de output de %e

source: Solver::addMonitor: Cannot reduce timestep (from %g to %g) after init is called!
es: Solver::addMonitor: No se puedo reducir el intervalo de tiempo (de %g a %g) después de que init fuera llamado!

source: Time derivative at wrong location - Field is at %s, derivative is at %s for field '%s'
es: Derivada del tiempo en lugar erróneo - El field se encuentra en %s, la derivada se encuentra en %s para el field '%s'

source: Time derivative for variable '%s' not set
es: Derivada del tiempo para la variable '%s' no fijada

source: Trying to add an already existing region %s to regionMap2D
es: Intentando añadir una región ya existente %s a regionMap2D

source: Trying to add an already existing region %s to regionMap3D
es: Intentando añadir una región ya existente %s a regionMap3D

source: Trying to add an already existing region %s to regionMapPerp
es: Intentando añadir una región ya existente %s a regionMapPerp

source: Unrecognised paralleltransform option. Valid choices are 'identity', 'shifted', 'fci'
es: Opción paralleltransform desconocida. Opciones válidas son 'identity', 'shifted', 'fci'

source: Unused options:
es: Opciones sin usar:

source: Usage is %s -d <data directory>
es: Correcto uso es %s -d <data directory>

source: Usage is %s -f <options filename>
es: Correcto uso es %s -f <options filename>

source: Usage is %s -l <log filename>
es: Correcto uso es %s -l <log filename>

source: Usage is %s -o <settings filename>
es: Correcto uso es %s -o <settings filename>

source: Usage: %s [-d <data directory>] [-f <options filename>] [restart [append]] [VAR=VALUE]
es: Uso: %s [-d <data directory>] [-f <options filename>] [restart [append]] [VAR=VALUE]

source: Value for option %s = %e is not an integer
es: Valor para la opción %s = %e no es un entero

source: Variable '%s' not initialised
es: Variable '%s' sin inicializar

source: Writing options to file %s
es: Escribiendo opciones a archivo %s

source: default
es: por defecto

source: nx must be greater than 2*MXG
es: nx debe ser mayor que 2*MXG
